Revit 2026 API

# FieldBuilder Properties

---

The FieldBuilder type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

FieldBuilder Class

Autodesk.Revit.DB.ExtensibleStorage Namespace